app/views/ticket_types/_form.html.erb

SELECT "events".* FROM "events" ORDER BY "events"."name" ASC
---
    <%= form.label :event_id %>
    <%= form.collection_select :event_id, Event.order(:name), :id, :name %>