app/views/shopings/_form.html.erb

SELECT "events".* FROM "events" ORDER BY "events"."name" ASC
---
    <%= f.label "Event/price" %>
    <%= f.grouped_collection_select :ticket_type_id, Event.order(:name), :ticket_types, :name, :id, :price %>