app/controllers/events_controller.rb

SELECT "places".* FROM "places"
---
  def new
    @event = Event.new
    @places = Place.all

INSERT INTO "events" ("name", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ELEVENTOTERRIBLEDECHOROO"], ["start_date", "2021-05-22"], ["place_id", 1], ["created_at", "2019-05-22 17:01:38.543270"], ["updated_at", "2019-05-22 17:01:38.543270"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save