app/controllers/shopings_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @shopings = Event.all