app/controllers/ticket_types_controller.rb

SELECT "ticket_types".* FROM "ticket_types"
---
  def index
    @ticket_types = TicketType.all

INSERT INTO "ticket_types" ("price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", 5000], ["event_id", 5], ["created_at", "2019-05-22 18:14:35.842044"], ["updated_at", "2019-05-22 18:14:35.842044"]]
---
  def create
    @ticket_type = TicketType.new(ticket_type_params)

    respond_to do |format|
      if @ticket_type.save

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_ticket_type
      @ticket_type = TicketType.find(params[:id])